Revit 2027 API
FabricationServiceSettings.GetFluidTemperature Method
 Gets the fluid temperature of the specified service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetFluidTemperature(
	FabricationService service
)
Public Function GetFluidTemperature (
	service As FabricationService
) As Double
public:
double GetFluidTemperature(
	FabricationService^ service
)
member GetFluidTemperature :
        service : FabricationService -> float
Parameters
service FabricationService
 The service to lookup.
Return Value
Double
 The temperature in Kelvin.
Exceptions
Exception | Condition
ArgumentException |  service is not mapped to a fluid type and temperature.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace